sharmarkeahmed/predictive-humidity-controller/firmware/stm32/Core/Src/main.c
/* Touch calibration structure */
typedef struct {
    int16_t x_min;      /* Minimum X raw value (usually top-left) */
    int16_t x_max;      /* Maximum X raw value (usually bottom-right) */
    int16_t y_min;      /* Minimum Y raw value (usually top-left) */
    int16_t y_max;      /* Maximum Y raw value (usually bottom-right) */
    bool calibrated;
} TouchCalibration;

TouchCalibration touch_cal = {0};


// BUNCH OF HELPER FUNCTIONS FOR DEBUG UNCOMMENT, NOT CALLED IN MAIN
///* Function to display calibration instructions and wait for touch */
//TS_Point wait_for_touch_with_indicator(XPT2046_t *ts, ILI9341_t3 *tft,
//                                        int16_t target_x, int16_t target_y,
//                                        const char *message)
//{
//    TS_Point point;
//
//    /* Clear area and show instruction */
//    ILI9341_fillRect(tft, 0, tft->_height - 40, tft->_width, 40, ILI9341_BLACK);
//    ILI9341_setTextSize(tft, 1);
//    ILI9341_setTextColorBG(tft, ILI9341_YELLOW, ILI9341_BLACK);
//    ILI9341_setCursor(tft, 10, tft->_height - 30);
//    ILI9341_writeString(tft, message);
//
//    /* Draw target circle */
//    ILI9341_fillCircle(tft, target_x, target_y, 10, ILI9341_RED);
//    ILI9341_drawCircle(tft, target_x, target_y, 12, ILI9341_WHITE);
//
//    /* Wait for touch */
//    while (1) {
//        if (XPT2046_touched(ts)) {
//            point = XPT2046_getPoint(ts);
//
//            /* Show raw values while touching */
//            char raw_str[32];
//            ILI9341_fillRect(tft, 0, tft->_height - 20, 200, 20, ILI9341_BLACK);
//            ILI9341_setTextSize(tft, 1);
//            ILI9341_setTextColorBG(tft, ILI9341_CYAN, ILI9341_BLACK);
//            ILI9341_setCursor(tft, 10, tft->_height - 15);
//            sprintf(raw_str, "Raw: X=%4d Y=%4d", point.x, point.y);
//            ILI9341_writeString(tft, raw_str);
//
//            /* Wait for touch release */
//            while (XPT2046_touched(ts)) {
//                osDelay(10);
//            }
//
//            /* Confirm with user */
//            ILI9341_fillRect(tft, 0, tft->_height - 40, tft->_width, 40, ILI9341_BLACK);
//            ILI9341_setTextColorBG(tft, ILI9341_GREEN, ILI9341_BLACK);
//            ILI9341_setCursor(tft, 10, tft->_height - 30);
//            ILI9341_writeString(tft, "Touch registered! Releasing...");
//            osDelay(500);
//
//            break;
//        }
//        osDelay(10);
//    }
//
//    /* Clear the target circle */
//    ILI9341_fillCircle(tft, target_x, target_y, 12, ILI9341_BLACK);
//
//    return point;
//}
//
///* Calibration routine */
//bool calibrate_touchscreen(XPT2046_t *ts, ILI9341_t3 *tft)
//{
//    TS_Point points[4];
//    int16_t screen_points[4][2] = {
//        {10, 10},           /* Top-left */
//        {tft->_width - 10, 10},  /* Top-right */
//        {10, tft->_height - 10}, /* Bottom-left */
//        {tft->_width - 10, tft->_height - 10}  /* Bottom-right */
//    };
//
//    const char *messages[] = {
//        "Touch the RED circle at TOP-LEFT corner",
//        "Touch the RED circle at TOP-RIGHT corner",
//        "Touch the RED circle at BOTTOM-LEFT corner",
//        "Touch the RED circle at BOTTOM-RIGHT corner"
//    };
//
//    ILI9341_fillScreen(tft, ILI9341_BLACK);
//    ILI9341_setTextSize(tft, 2);
//    ILI9341_setTextColorBG(tft, ILI9341_WHITE, ILI9341_BLACK);
//    ILI9341_setCursor(tft, 10, 10);
//    ILI9341_writeString(tft, "Touch Screen Calibration");
//    ILI9341_setCursor(tft, 10, 40);
//    ILI9341_writeString(tft, "Follow the instructions");
//    osDelay(2000);
//
//    /* Collect calibration points */
//    for (int i = 0; i < 4; i++) {
//        points[i] = wait_for_touch_with_indicator(ts, tft,
//                                                   screen_points[i][0],
//                                                   screen_points[i][1],
//                                                   messages[i]);
//
//        /* Validate raw values are within range */
//        if (points[i].x < 0 || points[i].x > 4095 ||
//            points[i].y < 0 || points[i].y > 4095) {
//            ILI9341_fillScreen(tft, ILI9341_BLACK);
//            ILI9341_setTextColorBG(tft, ILI9341_RED, ILI9341_BLACK);
//            ILI9341_setCursor(tft, 10, 10);
//            ILI9341_writeString(tft, "Calibration Error!");
//            ILI9341_setCursor(tft, 10, 40);
//            ILI9341_writeString(tft, "Invalid touch values");
//            osDelay(2000);
//            return false;
//        }
//    }
//
//    /* Calculate min/max values */
//    touch_cal.x_min = points[0].x;
//    touch_cal.x_max = points[0].x;
//    touch_cal.y_min = points[0].y;
//    touch_cal.y_max = points[0].y;
//
//    for (int i = 1; i < 4; i++) {
//        if (points[i].x < touch_cal.x_min) touch_cal.x_min = points[i].x;
//        if (points[i].x > touch_cal.x_max) touch_cal.x_max = points[i].x;
//        if (points[i].y < touch_cal.y_min) touch_cal.y_min = points[i].y;
//        if (points[i].y > touch_cal.y_max) touch_cal.y_max = points[i].y;
//    }
//
//    /* Add a small margin */
//    touch_cal.x_min -= 20;
//    touch_cal.x_max += 20;
//    touch_cal.y_min -= 20;
//    touch_cal.y_max += 20;
//
//    /* Clamp to valid range */
//    if (touch_cal.x_min < 0) touch_cal.x_min = 0;
//    if (touch_cal.x_max > 4095) touch_cal.x_max = 4095;
//    if (touch_cal.y_min < 0) touch_cal.y_min = 0;
//    if (touch_cal.y_max > 4095) touch_cal.y_max = 4095;
//
//    touch_cal.calibrated = true;
//
//    /* Show calibration results */
//    ILI9341_fillScreen(tft, ILI9341_BLACK);
//    ILI9341_setTextSize(tft, 2);
//    ILI9341_setTextColorBG(tft, ILI9341_GREEN, ILI9341_BLACK);
//    ILI9341_setCursor(tft, 10, 10);
//    ILI9341_writeString(tft, "Calibration Complete!");
//
//    ILI9341_setTextSize(tft, 1);
//    ILI9341_setTextColorBG(tft, ILI9341_WHITE, ILI9341_BLACK);
//    ILI9341_setCursor(tft, 10, 50);
//    char buf[64];
//    sprintf(buf, "X Range: %d - %d", touch_cal.x_min, touch_cal.x_max);
//    ILI9341_writeString(tft, buf);
//    ILI9341_setCursor(tft, 10, 70);
//    sprintf(buf, "Y Range: %d - %d", touch_cal.y_min, touch_cal.y_max);
//    ILI9341_writeString(tft, buf);
//
//    ILI9341_setCursor(tft, 10, 100);
//    ILI9341_writeString(tft, "Touch anywhere to test");
//
//    /* Test calibration */
//    while (1) {
//        if (XPT2046_touched(ts)) {
//            TS_Point test = XPT2046_getPoint(ts);
//
//            /* Convert raw to screen coordinates */
//            int16_t screen_x = (int16_t)((uint32_t)(test.x - touch_cal.x_min) *
//                                         tft->_width / (touch_cal.x_max - touch_cal.x_min));
//            int16_t screen_y = (int16_t)((uint32_t)(test.y - touch_cal.y_min) *
//                                         tft->_height / (touch_cal.y_max - touch_cal.y_min));
//
//            /* Clamp to screen bounds */
//            if (screen_x < 0) screen_x = 0;
//            if (screen_x >= tft->_width) screen_x = tft->_width - 1;
//            if (screen_y < 0) screen_y = 0;
//            if (screen_y >= tft->_height) screen_y = tft->_height - 1;
//
//            /* Show calibrated coordinates */
//            ILI9341_fillRect(tft, 10, 130, 220, 50, ILI9341_BLACK);
//            ILI9341_setTextSize(tft, 2);
//            ILI9341_setTextColorBG(tft, ILI9341_YELLOW, ILI9341_BLACK);
//            ILI9341_setCursor(tft, 10, 130);
//            sprintf(buf, "X:%3d Y:%3d", screen_x, screen_y);
//            ILI9341_writeString(tft, buf);
//
//            /* Draw touch point */
//            ILI9341_fillCircle(tft, screen_x, screen_y, 5, ILI9341_RED);
//
//            /* Wait for touch release */
//            while (XPT2046_touched(ts)) {
//                osDelay(10);
//            }
//
//            /* Clear touch point */
//            ILI9341_fillCircle(tft, screen_x, screen_y, 5, ILI9341_BLACK);
//        }
//        osDelay(10);
//    }
//
//    return true;
//}
//
///* Function to convert raw touch coordinates to screen coordinates */
//bool touch_to_screen(XPT2046_t *ts, int16_t *screen_x, int16_t *screen_y)
//{
//    if (!touch_cal.calibrated) {
//        return false;
//    }
//
//    TS_Point raw = XPT2046_getPoint(ts);
//
//    /* Apply rotation first (if needed) */
//    int16_t raw_x = raw.x;
//    int16_t raw_y = raw.y;
//
//    /* Convert raw values to screen coordinates using calibration */
//    *screen_x = (int16_t)((uint32_t)(raw_x - touch_cal.x_min) *
//                          ILI9341_width(&tft) / (touch_cal.x_max - touch_cal.x_min));
//    *screen_y = (int16_t)((uint32_t)(raw_y - touch_cal.y_min) *
//                          ILI9341_height(&tft) / (touch_cal.y_max - touch_cal.y_min));
//
//    /* Clamp to screen bounds */
//    if (*screen_x < 0) *screen_x = 0;
//    if (*screen_x >= ILI9341_width(&tft)) *screen_x = ILI9341_width(&tft) - 1;
//    if (*screen_y < 0) *screen_y = 0;
//    if (*screen_y >= ILI9341_height(&tft)) *screen_y = ILI9341_height(&tft) - 1;
//
//    return true;
//}

void initLCD(void){
	/* Hard reset */
	    HAL_GPIO_WritePin(TFT_CS_PORT,  TFT_CS_PIN,  GPIO_PIN_SET);
	    HAL_GPIO_WritePin(TFT_DC_PORT,  TFT_DC_PIN,  GPIO_PIN_SET);
	    HAL_GPIO_WritePin(TFT_RST_PORT, TFT_RST_PIN, GPIO_PIN_SET);
	    osDelay(10);
	    HAL_GPIO_WritePin(TFT_RST_PORT, TFT_RST_PIN, GPIO_PIN_RESET);
	    osDelay(20);
	    HAL_GPIO_WritePin(TFT_RST_PORT, TFT_RST_PIN, GPIO_PIN_SET);
	    osDelay(150);
}

static void lcd_draw_idle(void)
{
  ILI9341_fillScreen(&tft, ILI9341_BLACK);
  ILI9341_setTextSize(&tft, 2);
  ILI9341_setTextColorBG(&tft, ILI9341_YELLOW, ILI9341_BLACK);

  const char *msg = "Touch anywhere";
  uint16_t tw = ILI9341_measureTextWidth (&tft, msg, 0);
  uint16_t th = ILI9341_measureTextHeight(&tft, msg, 0);
  ILI9341_setCursor(&tft,
                    (ILI9341_width (&tft) - (int16_t)tw) / 2,
                    (ILI9341_height(&tft) - (int16_t)th) / 2);
  ILI9341_writeString(&tft, msg);
}

/* Updated StartLCDTask with calibration */
void StartLCDTask(void *argument)
{
    (void)argument;
    char text[32];

    initLCD();
    /* Init display */
    ILI9341_init(&tft,
                 &hspi1,
                 TFT_CS_PORT,  TFT_CS_PIN,
                 TFT_DC_PORT,  TFT_DC_PIN,
                 TFT_RST_PORT, TFT_RST_PIN);
    ILI9341_begin(&tft);
    ILI9341_setRotation(&tft, 1);
    ILI9341_fillScreen(&tft, ILI9341_BLACK);

    /* Init touch */
    XPT2046_init(&ts,
                 &hspi1,
                 TS_CS_PORT,  TS_CS_PIN,
                 TS_IRQ_PORT, TS_IRQ_PIN);
    XPT2046_begin(&ts);

    /* IMPORTANT: Don't set touch rotation - we'll handle mapping via calibration */
    XPT2046_setRotation(&ts, 1);  /* Raw mode, no rotation */

    /* Run calibration */
//    ILI9341_fillScreen(&tft, ILI9341_BLACK);
//    calibrate_touchscreen(&ts, &tft);

