sharmarkeahmed/predictive-humidity-controller/firmware/stm32/Core/Src/main.c
    /* The calibration function runs indefinitely for testing */
    /* If you want to exit calibration after testing, you would need to add a timeout or button press */
    lcd_draw_idle();

     for (;;)
     {

       TS_Point p;

       /* Poll every 20 ms – yields CPU to other tasks between checks */
       osDelay(20);

       /* Fast GPIO pre-check: T_IRQ HIGH = no touch, skip SPI entirely */
       if (!XPT2046_touched(&ts))
         continue;

       /* Debounce: wait 50 ms then confirm touch is still present */
       osDelay(50);
       if (!XPT2046_touched(&ts))
         continue;

       /* Read position – single SPI transaction */
       p = XPT2046_getPoint(&ts);
       if (p.z < XPT2046_Z_THRESHOLD)
         continue;

       /* Map 12-bit ADC (0-4095) → pixel coords */
       int16_t px = (int16_t)((p.x * (uint32_t)ILI9341_width (&tft)) / 4096);
       int16_t py = (int16_t)((p.y * (uint32_t)ILI9341_height(&tft)) / 4096);
       if (px < 0)                     px = 0;
       if (py < 0)                     py = 0;
       if (px >= ILI9341_width (&tft)) px = ILI9341_width (&tft)  - 1;
       if (py >= ILI9341_height(&tft)) py = ILI9341_height(&tft) - 1;

       /* Redraw screen */
       snprintf(text, sizeof(text), "X:%-4d  Y:%-4d", (int)px, (int)py);

       ILI9341_fillScreen(&tft, ILI9341_BLACK);
       ILI9341_setTextSize(&tft, 2);
       ILI9341_setTextColorBG(&tft, ILI9341_YELLOW, ILI9341_BLACK);
       {
         uint16_t tw = ILI9341_measureTextWidth (&tft, text, 0);
         uint16_t th = ILI9341_measureTextHeight(&tft, text, 0);
         ILI9341_setCursor(&tft,
                           (ILI9341_width (&tft) - (int16_t)tw) / 2,
                           (ILI9341_height(&tft) - (int16_t)th) / 2);
       }
       ILI9341_writeString(&tft, text);

//       lcdDrawCursor(); // Create cursor object
       ILI9341_drawFastHLine(&tft, px - 10, py,      21, ILI9341_RED);
       ILI9341_drawFastVLine(&tft, px,      py - 10, 21, ILI9341_RED);
       ILI9341_fillCircle   (&tft, px, py, 4, ILI9341_RED);

       /* Wait for finger-lift */
       do { osDelay(20); } while (XPT2046_touched(&ts));

       /* Restore idle screen */
       lcd_draw_idle();
     }
}

/* --------------------------------------------------------------------------
 * SHT3x task (unchanged from original)
 * -------------------------------------------------------------------------- */
void StartSht3xTask(void *argument)
{
  (void)argument;

#if ENABLE_SHT3X
  sht3x_sample_t sample;

  for (;;)
  {
    if (!sht3x_sensor.initialized)
    {
      g_sht3x_sensor_ready = sht3x_init(&sht3x_sensor, &hi2c2, SHT3X_I2C_ADDRESS);
      g_sht3x_last_error   = sht3x_sensor.last_error;

      if (!g_sht3x_sensor_ready)
      {
        g_sht3x_sample_valid = false;
        g_sht3x_error_count++;
        osDelay(SHT3X_TASK_RETRY_DELAY_MS);
        continue;
      }
    }

    if (sht3x_read(&sht3x_sensor, &sample))
    {
      g_sht3x_sample       = sample;
      g_sht3x_last_error   = HAL_OK;
      g_sht3x_sensor_ready = true;
      g_sht3x_sample_valid = true;
      g_sht3x_read_count++;
    }
    else
    {
      g_sht3x_last_error   = sht3x_sensor.last_error;
      g_sht3x_sensor_ready = false;
      g_sht3x_sample_valid = false;
      g_sht3x_error_count++;
    }

    osDelay(SHT3X_TASK_PERIOD_MS);
  }
#else
  for (;;) osDelay(1000);
#endif
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */

  for(;;)
  {
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5, GPIO_PIN_RESET);
    osDelay(500);

    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5, GPIO_PIN_SET);
    osDelay(500);
  }

  /* USER CODE END 5 */
}
/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM5 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM5)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
